In [1]:
# Importing important Library
#!pip install ipython-sql
import sqlite3
# Then load the SQL module:
%load_ext sql
#connection string to connect to the database
%sql sqlite://

In [2]:
%%sql
-- This create the table name personal
CREATE TABLE personal (
    Empno integer NOT NULL UNIQUE,
    Name varchar(255) NOT NULL,
    DoB date CHECK (Dob > '1960-01-12'),
    Nativeplace varchar(255),
    Hobby varchar(255) NOT NULL
);

-- This create the table name job
CREATE TABLE job (
    sno integer NOT NULL UNIQUE,
    Area varchar(255) NOT NULL,
    App_date date,
    Salary integer CHECK (Salary BETWEEN 4000 AND 10000),
    Retd_date date,
    Dept varchar(255) NOT NULL
);

 * sqlite://
Done.
Done.

[]

In [3]:
%%sql
INSERT into personal values(123,'Amit','1965-01-23','Delhi','Music');
INSERT into personal values(127,'Manoj','1976-12-12','Mumbai','Writing');
INSERT into personal values(124,'Abhai','1975-08-11','Allahabad','Music');
INSERT into personal values(125,'Vinod','1977-04-04','Delhi','Sports');
INSERT into personal values(128,'Abhay','1974-10-03','Mumbai','Gardening');
INSERT into personal values(129,'Ramesh','1981-10-28','Pune','Sports');

INSERT into job values(123,'Agra','2006-01-25',5000,'2026-01-25','Marketing');
INSERT into job values(127,'Mathura','2006-01-25',6000,'2026-12-22','Finance');
INSERT into job values(124,'Agra','2006-01-25',5500,'2027-08-19','Marketing');
INSERT into job values(125,'Delhi','2006-01-25',8500,'2026-04-14','Marketing');
INSERT into job values(128,'Pune','2006-01-25',7500,'2026-01-25','Sales');
INSERT into job values(129,'Surat','2006-01-25',9000,'2028-03-13','Sales');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql
SELECT * FROM personal;

 * sqlite://
Done.

[(123, 'Amit', '1965-01-23', 'Delhi', 'Music'),
 (127, 'Manoj', '1976-12-12', 'Mumbai', 'Writing'),
 (124, 'Abhai', '1975-08-11', 'Allahabad', 'Music'),
 (125, 'Vinod', '1977-04-04', 'Delhi', 'Sports'),
 (128, 'Abhay', '1974-10-03', 'Mumbai', 'Gardening'),
 (129, 'Ramesh', '1981-10-28', 'Pune', 'Sports')]

In [5]:
%%sql
SELECT * FROM job;

 * sqlite://
Done.

[(123, 'Agra', '2006-01-25', 5000, '2026-01-25', 'Marketing'),
 (127, 'Mathura', '2006-01-25', 6000, '2026-12-22', 'Finance'),
 (124, 'Agra', '2006-01-25', 5500, '2027-08-19', 'Marketing'),
 (125, 'Delhi', '2006-01-25', 8500, '2026-04-14', 'Marketing'),
 (128, 'Pune', '2006-01-25', 7500, '2026-01-25', 'Sales'),
 (129, 'Surat', '2006-01-25', 9000, '2028-03-13', 'Sales')]

## 1. Show number of employee area wise

In [6]:
%%sql
SELECT Area,COUNT(*) AS "Number of Employee"
FROM job
GROUP BY Area;

 * sqlite://
Done.

[('Agra', 2), ('Delhi', 1), ('Mathura', 1), ('Pune', 1), ('Surat', 1)]

## 2. Show the hobbies and native places of those whose name pronounces as 'Abhay'.

In [7]:
%%sql
SELECT Hobby,Nativeplace
FROM personal
WHERE Name = 'Abhay';

 * sqlite://
Done.

[('Gardening', 'Mumbai')]

## 3. Increase salary of the employees by 5% of their present salary with hobby as Music

In [8]:
%%sql
UPDATE job
SET 
    Salary = Salary * 1.05
WHERE 
    sno IN ( SELECT Empno
            FROM personal
            WHERE Hobby = "Music"
    );

 * sqlite://
2 rows affected.

[]

In [9]:
%%sql
SELECT * FROM job;

 * sqlite://
Done.

[(123, 'Agra', '2006-01-25', 5250, '2026-01-25', 'Marketing'),
 (127, 'Mathura', '2006-01-25', 6000, '2026-12-22', 'Finance'),
 (124, 'Agra', '2006-01-25', 5775, '2027-08-19', 'Marketing'),
 (125, 'Delhi', '2006-01-25', 8500, '2026-04-14', 'Marketing'),
 (128, 'Pune', '2006-01-25', 7500, '2026-01-25', 'Sales'),
 (129, 'Surat', '2006-01-25', 9000, '2028-03-13', 'Sales')]

## 4.Show the hobby of which there are 2 or more employees

In [14]:
%%sql
SELECT Hobby, count(*) As 'Number of Empolyee'
FROM Personal
GROUP BY Hobby
HAVING count(Hobby) >= 2;

 * sqlite://
Done.

[('Music', 2), ('Sports', 2)]

## 5. Show the appointment date & native place of those whose name starts with 'A or ends with 'd'